yngrk/hoihoi-assistant/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# --- Flash: 16 MB, QIO @ 80 MHz ---
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# --- Partitionstabelle ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- PSRAM: 8 MB im Octal-Modus @ 80 MHz (das "R8" in N16R8) ---
# Ohne diese drei Zeilen bleiben nur ~320 KB internes RAM und der
# 400x300-Framebuffer laesst sich nicht allozieren.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# --- Konsole: UART0 primaer, zusaetzlich ueber nativen USB (COM6) ---
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- CPU-Takt: 240 MHz statt der IDF-Vorgabe von 160 MHz ---
# Der S3 kann 240 MHz. Fuer den Bring-up war der Unterschied egal, fuer die
# Audioverarbeitung (Mikrofon, Keyword-Erkennung) ist er es nicht.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
